import React from 'react';
import { ScrollArea } from "@/components/ui/scroll-area";

const AboutPage = () => {
  return (
    <ScrollArea className="h-[calc(100vh-180px)]">
      <div className="flex flex-col items-center justify-center bg-[#1f0637] p-8">
        <img src="/laternalogo-full.png" alt="Laterna Logo" className="size-64 object-contain" />
      </div>
      <div className="p-8 text-zinc-300">
        <h1 className="text-2xl font-bold mb-4">Λατέρνα</h1>
        <p className="mb-4">Σε μία κοινωνία που τα πάντα αποτελούν εμπόρευμα, από τις πρώτες και βασικές μας ανάγκες μέχρι τις τελευταίες και πιο δευτερεύουσες επιθυμίες μας, κάθε αγαθό είτε υλίκο είτε άυλο έχει την τιμή του, όπως οι ραδιοσυχνότητες, ο ήχος και η μουσική. Έναντια, λοιπόν, σε αύτη την κατάσταση και ενώ η αυτοοργάνωση και η αντι-εμπορευματοποίηση διεκδικούν όλο και περισσότερο χώρο, επιχειρήσαμε να συμβάλλουμε στη διάδοσή τους και στο διαδίκτυο, απαλλοτριώνοντας κάτι ακόμα που μας ανήκει και γίνεται αντικείμενο εκμετάλλευσης, τη μουσική. Έχουμε, επομένως, την ανάγκη να δημιουργήσουμε μια πλατφόρμα, με πρόταγμα το αντιεμπορικό και το αυτοοργανωμένο, η οποία θα διανέμει ελεύθερα τη μουσική χωρίς την άμεση (ποσοστά) ή έμμεση (διαφημίσεις) εκμετάλλευση είτε του ακροατού είτε του δημιουργού.</p>
        <p className="mb-4"> Αρχικά, ως ακροατά, μας λείπει να ακούμε μουσική ανενόχλητα, χωρίς διακοπές για διαφημίσεις, χωρίς δεδομένα κινητής και χωρίς να γεμίζουμε ιούς τις συσκευές μας με downloads. Παράλληλα, χωρίς να “νοικιάζουμε” τραγούδια πληρώνοντας premium σε μεγαλοεταιρίες που συνεχίζουν να πλουτίζουν καπηλευόμενες αφενός ξένες δημιουργίες και αφετέρου την ανάγκη μας για μουσική. Δε θέλουμε να μας αναγκάζουν –έστω και καταλάθος– να ακούμε είτε κομμάτια με κακοποιητικό λόγο είτε άτομα με ανάλογες συμπεριφορές απλώς επειδή πατήσαμε “τυχαία αναπαραγωγή“.</p>
        <p className="mb-4"> Από την άλλη, ως δημιουργά έχουμε την ανάγκη να διανέμουμε τη μουσική μας δωρεάν σε όλα, δίνοντας ακόμη το ελεύθερο για επανεπεξεργασία και αναδημοσίευση. Δε θέλουμε να πλουτίζει κανείς από τις δικές μας δημιουργίες. Δε θέλουμε κανένας αριθμός, κανένα “like” και κανένα “share” να καθορίζουν την επιτυχία της μουσικής μας.</p>
        <p className="mb-4">Για όλους αυτούς τους λόγους δημιουργούμε τη “ΛΑΤΕΡΝΑ”. Μία πλατφόρμα όπου θα μπορούν δημιουργά να ανεβάζουν μουσικές κι ακροατά να ακούν ανενόχταμπλ, με ή χωρίς σύνδεση στο διαδίκτυο. </p>
        <p className="mb-4">Όσο η μουσική εμπορευματοποιείται, τόσο θα ανοίγουμε τα παράθυρα μας να ακούμε τη λατέρνα!</p>
        <p className="mb-4">Η πλατφόρμα είναι ανοιχτή να στείλεις τις δικές σου δημιουργίες, επικοινωνώντας με mail στο: <u><a href="mailto:radio@1431am.org">radio@1431am.org</a></u> με θέμα “λατέρνα”.</p>
        <p>Αντι-ιεραρχικά, χωρίς σεξιστικό και κακοποιητικό περιεχόμενο, πάντα αντιεξουσιαστικά ε;;;</p>
      </div>
    </ScrollArea>
  );
};

export default AboutPage;
